In [23]:
print(type(grouped1))
'''GroupBy Object 속성'''

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

'GroupBy Object 속성'

In [24]:
gr_dict = dict(list(grouped1))
gr_dict

{'ha':     A    B     Data1     Data2
 0  ha  one -0.331809 -0.580317
 3  ha  one -0.261885  0.600920,
 'hi':     A    B    Data1     Data2
 1  hi  two  0.76655 -0.764195,
 'ho':     A    B     Data1     Data2
 2  ho  one -0.688334  0.370315
 4  ho  two  0.353348 -0.059520}

In [25]:
grouped1.groups

{'ha': [0, 3], 'hi': [1], 'ho': [2, 4]}

In [26]:
gr_dict['ho']

    A    B     Data1     Data2
2  ho  one -0.688334  0.370315
4  ho  two  0.353348 -0.059520

In [27]:
grouped1.get_group('ho')

    A    B     Data1     Data2
2  ho  one -0.688334  0.370315
4  ho  two  0.353348 -0.059520

In [28]:
df.groupby(['A','B']).get_group(('ha','one'))

    A    B     Data1     Data2
0  ha  one -0.331809 -0.580317
3  ha  one -0.261885  0.600920

In [30]:
df.groupby(['A','B']).get_group(('ho','two'))
#df.groupby(['A','B']).get_group(('ha','two')) 오류 남 A ha 이면서 B two 인게 없어서

    A    B     Data1    Data2
4  ho  two  0.353348 -0.05952

In [31]:
grouped1.mean()

       Data1     Data2
A
ha -0.296847  0.010302
hi  0.766550 -0.764195
ho -0.167493  0.155397

In [40]:
grouped2 = df['Data2'].groupby(df['A'])
grouped2.groups

{'ha': [0, 3], 'hi': [1], 'ho': [2, 4]}

In [33]:
grouped2.mean()

A
ha    0.010302
hi   -0.764195
ho    0.155397
Name: Data2, dtype: float64

In [39]:
grouped3 = df['Data1'].groupby([df['A'],df['B']])
grouped3.groups

{('ha', 'one'): [0, 3], ('hi', 'two'): [1], ('ho', 'one'): [2], ('ho', 'two'): [4]}

In [41]:
grouped3

In [42]:
grouped3.mean()

A   B
ha  one   -0.296847
hi  two    0.766550
ho  one   -0.688334
    two    0.353348
Name: Data1, dtype: float64

In [45]:
mat = np.array(['water','oil','oil','water','oil'])
time = ['1h','1h','2h','2h','1h']

df['Data1'].groupby([mat,time]).mean()

oil    1h    0.559949
       2h   -0.688334
water  1h   -0.331809
       2h   -0.261885
Name: Data1, dtype: float64

In [46]:
df

    A    B     Data1     Data2
0  ha  one -0.331809 -0.580317
1  hi  two  0.766550 -0.764195
2  ho  one -0.688334  0.370315
3  ha  one -0.261885  0.600920
4  ho  two  0.353348 -0.059520

In [48]:
df2 = pd.DataFrame({'A':['ha','hi','ha'],
                  'B':['two','one','two'],
                  'Data1':np.random.randn(3)})
df2

    A    B     Data1
0  ha  two  0.937458
1  hi  one -0.289454
2  ha  two  0.861148

In [49]:
df2.groupby(['A']).sum()

       Data1
A
ha  1.798606
hi -0.289454

In [50]:
df2.groupby('A',sort=False).sum()

       Data1
A
ha  1.798606
hi -0.289454

In [51]:
arr = [['ha','ha','hi','hi','ho','ho'],['one','two','one','one','two','two']]
ind = pd.MultiIndex.from_arrays(arr,names = ['1st','2nd'])
ser = pd.Series(np.random.randn(6),index=ind)
ser

1st  2nd
ha   one    0.734117
     two    0.981335
hi   one   -0.830060
     one    0.533780
ho   two   -0.677024
     two   -1.485719
dtype: float64

In [54]:
ser.index
grouped = ser.groupby(level=1)
grouped.sum()

2nd
one    0.437837
two   -1.181408
dtype: float64

In [53]:
ser.groupby(level='2nd').sum()

2nd
one    0.437837
two   -1.181408
dtype: float64

In [21]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A':['ha','hi','ho','ha','ho'],
                  'B':['one','two','one','one','two'],
                  'Data1':np.random.randn(5),
                  'Data2':np.random.randn(5)})
df

    A    B     Data1     Data2
0  ha  one -0.331809 -0.580317
1  hi  two  0.766550 -0.764195
2  ho  one -0.688334  0.370315
3  ha  one -0.261885  0.600920
4  ho  two  0.353348 -0.059520

In [22]:
grouped1 = df.groupby('A')
grouped1

In [59]:
grouped1 = df.groupby('A')
for name,group in grouped1:
    print("name: ")
    print(name)
    print("group: ")
    print(group)

name:
ha
group:
    A    B     Data1     Data2
0  ha  one -0.331809 -0.580317
3  ha  one -0.261885  0.600920
name:
hi
group:
    A    B    Data1     Data2
1  hi  two  0.76655 -0.764195
name:
ho
group:
    A    B     Data1     Data2
2  ho  one -0.688334  0.370315
4  ho  two  0.353348 -0.059520

In [61]:
for (n1,n2),group in df.groupby(['A','B']):
    print((n1,n2))
    print(group)

('ha', 'one')
    A    B     Data1     Data2
0  ha  one -0.331809 -0.580317
3  ha  one -0.261885  0.600920
('hi', 'two')
    A    B    Data1     Data2
1  hi  two  0.76655 -0.764195
('ho', 'one')
    A    B     Data1     Data2
2  ho  one -0.688334  0.370315
('ho', 'two')
    A    B     Data1    Data2
4  ho  two  0.353348 -0.05952

In [62]:
grouped1 = df.groupby('A')
grouped1.agg(np.sum)

       Data1     Data2
A
ha -0.593695  0.020604
hi  0.766550 -0.764195
ho -0.334986  0.310795

In [63]:
grouped2 = df.groupby(['A','B'])
grouped2.agg('sum')

           Data1     Data2
A  B
ha one -0.593695  0.020604
hi two  0.766550 -0.764195
ho one -0.688334  0.370315
   two  0.353348 -0.059520